Revit 2024 API
ElementFilter Members
The ElementFilter type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ElementFilter
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PassesFilter(Element)
 Applies the filter to a given element.
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ElementFilter Class
Autodesk.Revit.DB Namespace